import { Gender, Size } from '../types/good';

export const SIZES: Size[] = ['XS', 'S', 'M', 'L', 'XL', 'XXL'];
export const GENDERS: Gender[] = ['man', 'women', 'unisex'];
export const COLORS = [
  'білий',
  'чорний',
  'сірий',
  'синій',
  'блакитний',
  'зелений',
  'жовтий',
  'червоний',
  'коричневий',
  'бежевий',
  'рожевий',
  'мʼятний',
];

// Back приймає такий список кольорів, розширений до фактичних даних в базі товарів
export const AVAILABLE_COLORS = [
  'білий',
  'чорний',
  'сірий',
  'синій',
  'блакитний',
  'зелений',
  'жовтий',
  'червоний',
  'коричневий',
  'бежевий',
  'рожевий',
  'мʼятний',
  'пастельні відтінки',
];
